INSERT INTO Categories(Name) VALUES
(N'Усі'),
(N'Наукова стаття'),
(N'Курсова робота'),
(N'Реферат'),
(N'Дипломна робота'),
(N'Художній твір'),
(N'Підручник'),
(N'Методичка')
GO

INSERT INTO Faculties(Name) VALUES
(N'Усі'),
(N'Кібернетики'),
(N'Радіофізичний'),
(N'Фізичний'),
(N'Механіко-математичний')
GO

INSERT INTO Departments(Name,FacultyID) VALUES
(N'Усі',0),
(N'Теоретичної кібернетики',1),
(N'Математичної інформатики',1),
(N'Теорії та технології програмування',1),
(N'Обчислювальної математики ',1),
(N'Моделювання складних систем',1),
(N'Дослідження операцій',1),
(N'Прикладної статистики',1),
(N'Системного аналізу і теорії прийняття рішень',1),
(N'Інформаційних систем',1),
(N'Фізичної електроніки',2),
(N'Квантової радіофізики',2),
(N'Комп’ютерної інженерії',2),
(N'Медичної радіофізики',2),
(N'Електрофізики',2),
(N'Нанофізики та наноелектроніки',2),
(N'Радіотехніки та радіоелектронних систем',2),
(N'Математики та теоретичної радіофізики',2),
(N'Астрономії та фізики космосу',3),
(N'Експериментальної фізики',3),
(N'Загальної фізики',3),
(N'Квантової теорії поля',3),
(N'Молекулярної фізики',3),
(N'Оптики',3),
(N'Теоретичної фізики',3),
(N'Фізики металів',3),
(N'Фізики функціональних матеріалів',3),
(N'Ядерної фізики',3),
(N'Алгебри та математичної логіки',4),
(N'Геометрії',4),
(N'Загальної математики',4),
(N'Інтегральних та диференціальних рівнянь',4),
(N'Математичного аналізу',4),
(N'Математичної фізики',4),
(N'Механіки суцільних середовищ',4),
(N'Теоретичної та прикладної механіки',4),
(N'Теорії ймовірностей, статистики та актуарної математики',4)
GO

INSERT INTO Authors(Surname, FirstName,SecondName, ShortName) VALUES 
('','','','<не вибрано>')
GO